app/controllers/recipes_controller.rb

  def index
  #@recipes = Recipe.all

  if params[:category_id]
    @category = Category.includes(:recipes)
                        .find(params[:category_id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]