app/controllers/recipes_controller.rb

  def create
    @recipe = Recipe.new(recipe_params)

    respond_to do |format|
      if @recipe.save
---
INSERT INTO "recipes" ("recipe_name", "image", "cooking_time", "desc", "ingredient_qty", "instructions", "servings", "created_at", "updated_at", "ingredient_id", "unit_id", "category_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @recipe.update(recipe_params)
---
UPDATE "recipes" SET "servings" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["servings", 2], ["updated_at", "2022-07-23 21:20:04.272415"], ["id", 6]]